
export const winTypes = {
  "Win":"胜利",
  "Fail":"失败"
}

export const judgeMent = {
  "1": "Carry局",
  "2": "背锅局",
  "4": "被虐局",
  "8": "翻盘局",
  "16": "福利局",
  "32": "挂机局",
  "64": "尽力局",
  "128": "浪输局",
  "256": "碾压局",
  "512": "甩锅局",
  "1024": "躺赢局"
}
export function getJudgeMent(id, length = 1){
  let result = [];
  result = Object.entries(judgeMent).filter(([key, value])=>{
    let v = key * 1;
    return id & v;
  }).map(v=>v[1]);
  return result.slice(0, length);
}

export const battleModes = {
  0: '自定义',
  1: '匹配赛',
  2: '匹配赛',
  8: '匹配赛',
  9: '灵活排位',
  14: '匹配赛',
  31: '人机赛',
  32: '人机赛',
  33: '人机赛',
  34: '人机赛',
  35: '人机赛',
  36: '人机赛',
  52: '人机赛',
  62: '大乱斗',
  63: '大乱斗',
  64: '大乱斗',
  65: '大乱斗',
  100: '匹配赛',
  300: '魄罗大乱斗',
  301: '魄罗大乱斗',
  320: '红月决',
  321: '红月决',
  400: '匹配赛',
  401: '匹配赛',
  402: '匹配赛',
  403: '匹配赛',
  420: '单双排',
  421: '单双排',
  422: '单双排',
  430: '匹配赛',
  431: '匹配赛',
  432: '匹配赛',
  433: '匹配赛',
  440: '灵活排位',
  441: '灵活排位',
  442: '灵活排位',
  450: '大乱斗',
  451: '大乱斗',
  452: '大乱斗',
  460: '匹配赛',
  470: '灵活排位',
  600: '红月决',
  601: '红月决',
  610: '暗星:奇点',
  611: '暗星:奇点',
  700: '冠军杯赛',
  701: '冠军杯赛',
  800: '人机赛',
  801: '人机赛',
  810: '人机赛',
  820: '人机赛',
  830: '人机赛',
  840: '人机赛',
  850: '人机赛',
  900: '无限火力',
  901: '无限火力',
  920: '魄罗大乱斗',
  921: '魄罗大乱斗',
  930: '大乱斗',
  931: '大乱斗',
  970: '六杀争夺战',
  1010: '冰雪无限火力',
  1011: '冰雪无限火力',
  1020: '克隆赛',
  1021: '克隆赛',
  1022: '克隆赛',
  1030: '奥德赛',
  1040: '奥德赛',
  1050: '奥德赛',
  1060: '奥德赛',
  1070: '奥德赛',
  1090: '云顶匹配赛',
  1100: '云顶排位赛',
  1200: '极限闪击',
  1400: '终极魔典',
  1900: '无限火力',
  2000: '新手教程',
  2010: '新手教程',
  2020: '新手教程',
  65535: '未知'
};

export const teamMadeMap = {
  1: "单排",
  2: "双排",
  3: "三黑",
  4: "四黑",
  5: "五黑",
}